{
    "name": "Agony in the Garden",
    "date": "2025-04-20",
    "photo": [
        "agony in the garden-9.jpg",
        "agony in the garden-6.jpg",
        "agony in the garden-side by side (1).jpg"
    ],
    "tags": [
        "portfolio",
        "human",
        "multi_subject",
        "multiaxial",
        "bp",
        "collaboration",
        "biblical",
        "has_cp",
        "has_video",
        "2024"
    ],
    "description": "Agony in the Garden: A collaboration with Michael Nguyen (@mayuncchigami) folded from a single uncut 65cm square. <br><br> This design depicts a quiet moment described by the gospel of Luke, when Jesus was praying in anguish in the garden of Gethsemane. “And there appeared to him an angel from heaven, strengthening him. And being in agony he prayed more earnestly; and his sweat became like great drops of blood falling down to the ground.”– Luke 22:43-44. We drew inspiration from an 1898 painting of this moment by Danish artist Frans Schwartz. <br><br> This was a deeply human moment in the life of Jesus, whose full humanity is often overlooked when we focus on his divinity. He was a single man about to take on the sin of all humanity—who wouldn't have been stressed? In this moment we see Jesus not only as the Son of God but also as the Son of Man, experiencing anguish, dread, and sorrow. Our God is not some guy in the clouds who can't relate to his people below, but a God who was willing to become human and bear a burden we never could. Through this model, Michael and I aimed to highlight this beauty of Jesus' humanity. <br><br> I brought the design skills, Michael brought the shaping skills, and together we came up with this design. Each of us folded our own version, so make sure to check out Michael's as well. May it invite you to see Jesus not only as divine, but as one who fully entered into human suffering out of love for us.",
    "cp": [
        "agony in the garden cp.jpg"
    ],
    "video": "https://youtube.com/shorts/geZx0CQwsW8",
    "diagrams": [
        "",
        ""
    ],
    "cpdescription": "The design is technically non-uniaxial because there are two axes-all of Jesus' flaps lie along one axis, and all of the angel's flaps lie along another axis, and the axes are parallel but offset from one another by a couple units. This is a common technique used to create multiple figures from the same sheet. Furthermore, the design relies on diagonal hinges that “rotate” the arms to be horizontal, perpendicular to the axis. The crease pattern also includes non-flat foldable shaping details drawn in.",
    "related": ""
}