{
    "name":"The Lord is my Shepherd",
    "date":"2022-09-05",
    "photo":["shepherd-0126.png",
        "shepherd.png"],
    "tags":["human",
        "animal",
        "hp",
        "biblical",
        "mammal",
        "uniaxial",
        "3d",
        "nonuniaxial",
        "2022"],
    "description":"Who is God, and what is He like? The Bible gives us many metaphors to help us understand God and how He relates to us--in this case, the relationship between a shepherd and a sheep. The images in this post quote from Psalm 23, a poem written by King David who was a shepherd himself. He describes God as his own shepherd: someone who provides everything he needs, brings him peace, walks with him and guides him, and protects him from danger. God is not just some distant ruler, but is personal, gentle, and loves us as His sheep.<br><br>But there's more to the story. Centuries later, the prophet Isaiah writes that \"All we like sheep have gone astray\" (Isaiah 53:6) and prophesies that someone will have to come to bear our sins. After that, the prophet Ezekiel writes, \"For thus says the Lord God: 'Behold, I, I myself will search for my sheep and will seek them out'\" (Ezekiel 34:11).<br><br>And finally, over 400 years later, Jesus comes in and declares, \"'I am the good shepherd. The good shepherd lays down his life for the sheep'\" (John 10:11). Jesus fulfilled both prophesies: he was the one who brought us back by bearing the sins of us sheep who wandered away, and he was the prophesied \"good shepherd\"--God personally seeking us.<br><br>Even though for now Jesus is no longer here physically, God does not change, and the reality of the Lord being our shepherd is just as real now as it was for David. There are times in this life when we feel like lost sheep, wandering around in the darkness, longing for still waters and green pastures. But the good news is that we have a good shepherd in Jesus. All we have to do is turn back to Him in faith, and He will shepherd us forever.",
    "cp":[],
    "video":"",
    "diagrams":["",""],
    "cpdescription":"",
    "related":""
}